# -- Brewfile used to install necessary packages

# -- Editors
brew "neovim"

# -- Languages and version managers
brew "go"
brew "python@3.11"
brew "ruby"
brew "n"  # Node.js version manager

# -- Terminal utilities
brew "eza"  # better ls
brew "fd"  # better find
brew "imagemagick"  # image processing
brew "optipng"  # image optimization
brew "ripgrep"  # better search
brew "stow"  # symlink manager
brew "tmux"  # terminal multiplexer
brew "zsh"  # shell

# -- Linters and formatters
brew "hadolint"  # Dockerfile linter
brew "shfmt"  # bash scripts
brew "stylua"  # Lua

# -- Version control
brew "git"
brew "gh"  # GitHub CLI

# -- Fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"
