# -- Brewfile used to install necessary packages

# -- Editors
brew "neovim"

# -- Languages and version managers
brew "go"
brew "java"
brew "pyenv"
brew "ruby"
brew "n"  # Node.js version manager
brew "uv"  # faster python package installer

# -- Terminal utilities
brew "eza"  # better ls
brew "fd"  # better find
brew "fzf"  # Fuzzy finder
brew "imagemagick"  # image processing
brew "jq"  # JSON processor
brew "optipng"  # image optimization
brew "ripgrep"  # better search
brew "stow"  # symlink manager
brew "tmux"  # terminal multiplexer
brew "zoxide"  # better cd
brew "zsh"  # shell

# -- Linters and formatters
brew "hadolint"  # Dockerfile linter
brew "shfmt"  # bash scripts
brew "stylua"  # Lua

# -- Version control
brew "git"
brew "gh"  # GitHub CLI
brew "git-delta"  # git pager
brew "pre-commit"

# -- Fonts
cask "font-caskaydia-cove-nerd-font"
