# -- Brewfile used to install necessary packages

# -- Editors
brew "neovim"

# -- Languages and version managers
brew "go"
brew "java"
brew "pyenv"
brew "ruby"
brew "rust"
brew "n"  # Node.js version manager
brew "uv"  # faster python package installer

# -- Terminal utilities
brew "bat"  # better cat
brew "catimg"  # image viewer
brew "eza"  # better ls
brew "fd"  # better find
brew "fzf"  # Fuzzy finder
brew "imagemagick"  # image processing
brew "jq"  # JSON processor
brew "optipng"  # image optimization
brew "ripgrep"  # better search
brew "stow"  # symlink manager
brew "tmux"  # terminal multiplexer
brew "tree"  # file tree visualizer
brew "zoxide"  # better cd
brew "zsh"  # shell

# -- Git utilities
tap  "jesseduffield/lazygit"
brew "jesseduffield/lazygit/lazygit"  # better Git UI

# -- Linters and formatters
brew "actionlint"  # GHA linter
brew "buildifier"  # Bazel formatter
brew "buf" # Protobuf linter
brew "hadolint"  # Dockerfile linter
brew "jsonnet"  # jsonnet template language and formatter
brew "markdownlint-cli"  # Markdown linter
brew "rustfmt"  # Rust formatter
brew "shfmt"  # bash scripts
brew "stylua"  # Lua
brew "fsouza/prettierd/prettierd" # Prettier daemon
brew "yamllint" # YAML

# -- Version control
brew "git"
brew "gh"  # GitHub CLI
brew "git-delta"  # git pager
brew "pre-commit"

# -- Fonts
cask "font-caskaydia-cove-nerd-font"
